D =[122 139 0.115;
114 126 0.120;
086 090 0.105;
134 144 0.090;
146 163 0.100;
107 136 0.120;
068 061 0.105;
117 062 0.080;
071 041 0.100;
098 120 0.115];

x_1=D(:,1);
x_2=D(:,2);
x_3=D(:,3);                         
X=[ones(length(x_1),1)  x_1 x_2];
beta=inv(X'*X)*X'*D(:,3);
y_ap=X*beta;


plot3 (x_1, x_2, x_3, 'r*');
hold on;
grid on;                                          %plota a função
[x_1,x_2] = meshgrid (30:0.5:180, 30:0.5:180);
k = beta(1) + beta(2).*(x_1) + beta(3).*(x_2);
mesh (x_1,x_2, k);


R2=1-sum((x_3-y_ap).^2)/sum((x_3-mean(x_3)).^2) %média R2


%cftool;
